In [335]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.linear_model import LogisticRegression

In [336]:
train_data = pd.read_csv('train.csv')
train_data.head()

test_data = pd.read_csv('test.csv')
test_data.head()
print(len(test_data))

223

#### Steps to achieve what we wanna do.
1. Get the training data and traget values in separate data frames
2. After we achive this, one important thing that we have to do is feature reduction and feature scaling.
3. After doing the above, we have to fit the model with the data and predict for the test data

In [337]:
train_data = train_data.drop(['Name','Ticket'],axis=1)
test_data = test_data.drop(['Name','Ticket'],axis=1)

In [338]:
train_data.head()
test_data.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0       2    male   8.0      1      1  36.7500   NaN        S
1       1  female  49.0      0      0  25.9292   D17        S
2       3    male   NaN      0      0   7.7375   NaN        Q
3       2  female  24.0      2      1  27.0000   NaN        S
4       1    male  36.0      0      0  26.2875   E25        S

In [339]:
train_data['Sex'].value_counts()

male      427
female    241
Name: Sex, dtype: int64

In [340]:
from sklearn.preprocessing import LabelEncoder

In [341]:
train_data['Sex'] = LabelEncoder().fit_transform(train_data['Sex'])
test_data['Sex'] = LabelEncoder().fit_transform(test_data['Sex'])

In [342]:
train_data.head()
test_data.head()

   Pclass  Sex   Age  SibSp  Parch     Fare Cabin Embarked
0       2    1   8.0      1      1  36.7500   NaN        S
1       1    0  49.0      0      0  25.9292   D17        S
2       3    1   NaN      0      0   7.7375   NaN        Q
3       2    0  24.0      2      1  27.0000   NaN        S
4       1    1  36.0      0      0  26.2875   E25        S

In [343]:
train_data['Age'].isnull().value_counts()

False    536
True     132
Name: Age, dtype: int64

In [344]:
train_data['Age'].fillna(method='bfill',inplace=True)

In [345]:
train_data.head()

   Pclass  Sex   Age  SibSp  Parch    Fare Cabin Embarked  Survived
0       2    0  29.0      1      0  26.000   NaN        S         1
1       3    1  39.0      0      0   8.050   NaN        S         0
2       2    1  39.0      0      0  26.000   NaN        S         0
3       3    0  29.0      0      4  21.075   NaN        S         0
4       3    1  25.0      0      0   7.050   NaN        S         0

In [346]:
train_data['SibSp'].isnull().value_counts()
train_data['Parch'].isnull().value_counts()
train_data['SibSp'].value_counts()
train_data['Parch'].value_counts()

0    502
1     92
2     59
5      5
3      5
4      4
6      1
Name: Parch, dtype: int64

In [347]:
train_data.drop(['Cabin'],axis=1,inplace=True)
test_data.drop(['Cabin'],axis=1,inplace=True)

In [348]:
train_data.head()

   Pclass  Sex   Age  SibSp  Parch    Fare Embarked  Survived
0       2    0  29.0      1      0  26.000        S         1
1       3    1  39.0      0      0   8.050        S         0
2       2    1  39.0      0      0  26.000        S         0
3       3    0  29.0      0      4  21.075        S         0
4       3    1  25.0      0      0   7.050        S         0

In [349]:
train_data['Pclass'].isnull().value_counts()
train_data['Fare'].isnull().value_counts()
train_data['Embarked'].fillna(method='bfill',inplace=True)

In [350]:
train_data['Embarked'] = LabelEncoder().fit_transform(train_data['Embarked'])

In [351]:
train_data_target = train_data['Survived']
train_data_feature = train_data.drop(['Survived'],axis=1)

In [352]:
train_data_target.head()

0    1
1    0
2    0
3    0
4    0
Name: Survived, dtype: int64

In [353]:
train_data_feature.head()
test_data.head()

   Pclass  Sex   Age  SibSp  Parch     Fare Embarked
0       2    1   8.0      1      1  36.7500        S
1       1    0  49.0      0      0  25.9292        S
2       3    1   NaN      0      0   7.7375        Q
3       2    0  24.0      2      1  27.0000        S
4       1    1  36.0      0      0  26.2875        S

In [354]:
test_data['Embarked'] = test_data['Embarked'].map({'S':1,'Q':2,'C':3,'nan':4})
test_data['Embarked'].unique()

array([ 1.,  2.,  3., nan])

In [355]:
from sklearn import preprocessing
scaler = preprocessing.StandardScaler()
scaler.fit(train_data_feature)

StandardScaler(copy=True, with_mean=True, with_std=True)

In [356]:
train_data_feature = scaler.transform(train_data_feature)
train_data_feature
train_data_feature = pd.DataFrame(train_data_feature,columns = ['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked'])
train_data_feature.head()

     Pclass       Sex       Age     SibSp     Parch      Fare  Embarked
0 -0.356681 -1.331084 -0.052202  0.436822 -0.476768 -0.133914  0.587893
1  0.846667  0.751267  0.650986 -0.489518 -0.476768 -0.530276  0.587893
2 -0.356681  0.751267  0.650986 -0.489518 -0.476768 -0.133914  0.587893
3  0.846667 -1.331084 -0.052202 -0.489518  4.206773 -0.242665  0.587893
4  0.846667  0.751267 -0.333478 -0.489518 -0.476768 -0.552357  0.587893

In [357]:
test_data = scaler.fit_transform(test_data)
test_data
test_data = pd.DataFrame(test_data,columns = ['Pclass','Sex','Age','SibSp','Parch','Fare','Embarked'])
test_data.head()

     Pclass       Sex       Age     SibSp     Parch      Fare  Embarked
0 -0.407117  0.697615 -1.412904  0.422658  1.098600  0.067746 -0.583185
1 -1.586170 -1.433455  1.257281 -0.434185 -0.481967 -0.109862 -0.583185
2  0.771936  0.697615       NaN -0.434185 -0.481967 -0.408454  0.751527
3 -0.407117 -1.433455 -0.370881  1.279502  1.098600 -0.092286 -0.583185
4 -1.586170  0.697615  0.410637 -0.434185 -0.481967 -0.103981 -0.583185

In [358]:
train_data_feature['Age'].fillna(method='bfill',inplace=True)

In [359]:
train_data_feature = train_data_feature[0:len(train_data_feature)-1]
train_data_target = train_data_target[0:len(train_data_target)-1]

train_data_feature.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 667 entries, 0 to 666
Data columns (total 7 columns):
Pclass      667 non-null float64
Sex         667 non-null float64
Age         667 non-null float64
SibSp       667 non-null float64
Parch       667 non-null float64
Fare        667 non-null float64
Embarked    667 non-null float64
dtypes: float64(7)
memory usage: 36.6 KB

In [360]:
clf = LogisticRegression(tol=0.000001,max_iter=1000)
clf.fit(train_data_feature,train_data_target)

/home/learner/anaconda3/lib/python3.7/site-packages/sklearn/linear_model/logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=1000,
                   multi_class='warn', n_jobs=None, penalty='l2',
                   random_state=None, solver='warn', tol=1e-06, verbose=0,
                   warm_start=False)

In [361]:
(clf.predict(train_data_feature)-train_data_target).value_counts()

 0    523
-1     82
 1     62
Name: Survived, dtype: int64

In [362]:
clf.score(train_data_feature,train_data_target)

0.7841079460269865

In [363]:
test_data['Age'].fillna(method='bfill',inplace=True)
test_data.info()
test_data['Embarked'].fillna(method='bfill',inplace=True)
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 223 entries, 0 to 222
Data columns (total 7 columns):
Pclass      223 non-null float64
Sex         223 non-null float64
Age         223 non-null float64
SibSp       223 non-null float64
Parch       223 non-null float64
Fare        223 non-null float64
Embarked    222 non-null float64
dtypes: float64(7)
memory usage: 12.3 KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 223 entries, 0 to 222
Data columns (total 7 columns):
Pclass      223 non-null float64
Sex         223 non-null float64
Age         223 non-null float64
SibSp       223 non-null float64
Parch       223 non-null float64
Fare        223 non-null float64
Embarked    223 non-null float64
dtypes: float64(7)
memory usage: 12.3 KB

In [364]:
predictions = clf.predict(test_data)

In [365]:
prediction = pd.DataFrame(predictions).to_csv('prediction.csv',index=None)

In [366]:
# That was my first ever ML model trained!! Yo, I am happy!!